In [1]:
from sqlalchemy import create_engine, text

In [2]:
database_name = 'scooters'   

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
connection_string

'postgresql://postgres:postgres@localhost:5432/scooters'

In [3]:
engine = create_engine(connection_string)

In [4]:
engine

Engine(postgresql://postgres:***@localhost:5432/scooters)

In [5]:
query = '''
SELECT *
FROM trips
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [6]:
result.fetchone()

(datetime.datetime(2019, 5, 1, 0, 0, 55, 423000), 'Bird', 'BRD2134', 'Powered9EAJL', Decimal('3.0'), Decimal('958.00528'), datetime.date(2019, 5, 1), datetime.time(0, 0, 20, 460000), datetime.date(2019, 5, 1), datetime.time(0, 2, 52, 346666), Decimal('36.1571'), Decimal('-86.8036'), Decimal('36.1566'), Decimal('-86.8067'), '[(36.157235, -86.803612), (36.157235, -86.80362), (36.157226, -86.803642), (36.157226, -86.803665), (36.157226, -86.803665), (36.157226, -86.803665), ... (2204 characters truncated) ... (36.155941, -86.809517), (36.155941, -86.809517), (36.155941, -86.809517), (36.155918, -86.809671), (36.155918, -86.809671), (36.155918, -86.809671)]', datetime.datetime(2019, 5, 2, 5, 30, 23, 780000))

In [7]:
result.fetchall()

[(datetime.datetime(2019, 5, 1, 0, 3, 33, 147000), 'Lyft', 'LFT5', 'Powered296631', Decimal('1.7156'), Decimal('1371.39112'), datetime.date(2019, 5, 1), datetime.time(0, 1, 50, 90000), datetime.date(2019, 5, 1), datetime.time(0, 3, 33, 26666), Decimal('36.15797'), Decimal('-86.77896'), Decimal('36.16054'), Decimal('-86.77689'), '[(36.15797, -86.77896), (36.15795, -86.77873), (36.15798, -86.77859), (36.15809, -86.77822), (36.15825, -86.77785), (36.1583, -86.77768), (36.15838,  ... (92 characters truncated) ... -86.77703), (36.15963, -86.77678), (36.15977, -86.77665), (36.15994, -86.77654), (36.16024, -86.77673), (36.16053, -86.77694), (36.16054, -86.77689)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 757000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2168', 'Powered7S2UU', Decimal('3.0'), Decimal('2296.588'), datetime.date(2019, 5, 1), datetime.time(0, 3, 47, 363333), datetime.date(2019, 5, 1), datetime.time(0, 7, 13, 596666), Decimal('36.1547'), Decimal('-86.7818'), Decimal('36.1565'), Decimal('-86.7868'), '[(36.155068, -86.782124), (36.156597, -86.78675)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 530000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2166', 'PoweredZIIVX', Decimal('3.0'), Decimal('1200.78744'), datetime.date(2019, 5, 1), datetime.time(0, 4, 21, 386666), datetime.date(2019, 5, 1), datetime.time(0, 6, 59, 176666), Decimal('36.1494'), Decimal('-86.7795'), Decimal('36.1531'), Decimal('-86.7796'), '[(36.149741, -86.779344), (36.149741, -86.779327), (36.149741, -86.779327), (36.149741, -86.779327), (36.149761, -86.77929), (36.149761, -86.77929),  ... (1433 characters truncated) ... , (36.153076, -86.779496), (36.153076, -86.779496), (36.153088, -86.77951), (36.153088, -86.77951), (36.153103, -86.779519), (36.153103, -86.779519)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 237000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2165', 'PoweredJ7MB3', Decimal('2.0'), Decimal('351.04988'), datetime.date(2019, 5, 1), datetime.time(0, 4, 27, 796666), datetime.date(2019, 5, 1), datetime.time(0, 6, 23, 150000), Decimal('36.1778'), Decimal('-86.7866'), Decimal('36.1774'), Decimal('-86.7876'), '[(36.177699, -86.786477), (36.177711, -86.786469), (36.177715, -86.786469), (36.177715, -86.786469), (36.177715, -86.786469), (36.177753, -86.786469) ... (885 characters truncated) ... ), (36.17741, -86.787652), (36.177383, -86.78775), (36.177383, -86.78775), (36.177383, -86.787766), (36.177383, -86.787766), (36.177383, -86.787766)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 207000)),
 (datetime.datetime(2019, 5, 1, 0, 5, 55, 570000), 'Bird', 'BRD2167', 'PoweredEJF1K', Decimal('3.0'), Decimal('984.252'), datetime.date(2019, 5, 1), datetime.time(0, 3, 56, 546666), datetime.date(2019, 5, 1), datetime.time(0, 6, 45, 786666), Decimal('36.1544'), Decimal('-86.7862'), Decimal('36.1515'), Decimal('-86.7844'), '[(36.154368, -86.785909), (36.151689, -86.784331), (36.151619, -86.784294), (36.151562, -86.784313)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 317000)),
 (datetime.datetime(2019, 5, 1, 0, 7, 55, 880000), 'Lyft', 'LFT10', 'Powered329418', Decimal('1.0939166667'), Decimal('0.0'), datetime.date(2019, 5, 1), datetime.time(0, 6, 50, 106666), datetime.date(2019, 5, 1), datetime.time(0, 7, 55, 740000), Decimal('36.15168'), Decimal('-86.78408'), Decimal('36.15171'), Decimal('-86.78411'), '[(36.15168, -86.78408), (36.15171, -86.78411)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 890000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 50, 240000), 'Lyft', 'LFT13', 'Powered438572', Decimal('2.9543833333'), Decimal('1161.41736'), datetime.date(2019, 5, 1), datetime.time(0, 7, 52, 853333), datetime.date(2019, 5, 1), datetime.time(0, 10, 50, 116666), Decimal('36.15193'), Decimal('-86.78439'), Decimal('36.15463'), Decimal('-86.78492'), '[(36.15193, -86.78439), (36.15188, -86.78432), (36.15186, -86.78425), (36.15199, -86.78421), (36.15207, -86.78412), (36.15219, -86.78404), (36.15233, ... (203 characters truncated) ... 4, -86.78436), (36.15392, -86.78445), (36.15405, -86.7846), (36.15427, -86.78473), (36.1545, -86.78487), (36.1546, -86.78491), (36.15463, -86.78492)]', datetime.datetime(2019, 5, 2, 7, 20, 32, 990000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 56, 13000), 'Bird', 'BRD2193', 'PoweredSX2AW', Decimal('6.0'), Decimal('2624.672'), datetime.date(2019, 5, 1), datetime.time(0, 6, 34, 436666), datetime.date(2019, 5, 1), datetime.time(0, 12, 48, 676666), Decimal('36.1708'), Decimal('-86.7893'), Decimal('36.1746'), Decimal('-86.786'), '[(36.170995, -86.789593), (36.173193, -86.791207), (36.174235, -86.787287), (36.174353, -86.787131), (36.174687, -86.785989), (36.174634, -86.78593), (36.174676, -86.785968), (36.174864, -86.786073)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 833000)),
 (datetime.datetime(2019, 5, 1, 0, 10, 56, 13000), 'Bird', 'BRD2194', 'PoweredL968V', Decimal('6.0'), Decimal('2624.672'), datetime.date(2019, 5, 1), datetime.time(0, 5, 36, 870000), datetime.date(2019, 5, 1), datetime.time(0, 11, 19, 183333), Decimal('36.1565'), Decimal('-86.7971'), Decimal('36.1512'), Decimal('-86.7968'), '[(36.15654, -86.797137), (36.153065, -86.798047), (36.151263, -86.796712)]', datetime.datetime(2019, 5, 2, 5, 30, 24, 920000))]

In [8]:
import pandas as pd

In [9]:
with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

trips.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [10]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)

scooters.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [11]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pubtimestamp    10 non-null     datetime64[ns]
 1   companyname     10 non-null     object
 2   triprecordnum   10 non-null     object
 3   sumdid          10 non-null     object
 4   tripduration    10 non-null     float64
 5   tripdistance    10 non-null     float64
 6   startdate       10 non-null     object
 7   starttime       10 non-null     object
 8   enddate         10 non-null     object
 9   endtime         10 non-null     object
 10  startlatitude   10 non-null     float64
 11  startlongitude  10 non-null     float64
 12  endlatitude     10 non-null     float64
 13  endlongitude    10 non-null     float64
 14  triproute       10 non-null     object
 15  create_dt       10 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 1.4+ KB

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bird'
'''

with engine.connect() as connection:
    bird = pd.read_sql(text(query), con = connection)

bird.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bolt'
'''

with engine.connect() as connection:
    bolt = pd.read_sql(text(query), con = connection)

bolt.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Gotcha'
'''

with engine.connect() as connection:
    gotcha = pd.read_sql(text(query), con = connection)

gotcha.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Jump'
'''

with engine.connect() as connection:
    jump = pd.read_sql(text(query), con = connection)

jump.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lime'
'''

with engine.connect() as connection:
    lime = pd.read_sql(text(query), con = connection)

lime.head()

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lyft'
'''

with engine.connect() as connection:
    lyft = pd.read_sql(text(query), con = connection)

lyft.head()

In [12]:
birddf = pd.read_csv('../data/birddf.csv')

In [13]:
birddf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [14]:
boltdf = pd.read_csv('../data/boltdf.csv')

In [15]:
boltdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:09,36.158986,-86.777469,Powered-a5530bc9-d4c0-7ad4-7e21-87bcca195865,Powered,65.71,Scooter,0.3,Bolt
1,2019-07-30 17:34:09,36.165869,-86.777765,Powered-751e19ec-b697-a51f-04ea-0bf9a2e125c9,Powered,69.41,Scooter,0.3,Bolt
2,2019-07-30 17:34:09,36.149978,-86.814553,Powered-f4909631-d138-c9ee-cbec-8efc5568b77d,Powered,67.99,Scooter,0.3,Bolt
3,2019-07-30 17:34:09,36.163135,-86.775989,Powered-601cf2bd-1750-3e32-c23a-aabc76b61d65,Powered,94.39,Scooter,0.3,Bolt
4,2019-07-30 17:34:09,36.150896,-86.804663,Powered-4aede0e0-a137-ca41-680e-c9c6b8a54fa9,Powered,99.49,Scooter,0.3,Bolt

In [16]:
gotchadf = pd.read_csv('../data/gotchadf.csv')

In [17]:
gotchadf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 22:53:32.163,33.792620,-84.402760,Powered2460,Powered,47.0,Scooter,0.15,Gotcha
1,2019-07-30 22:53:32.163,36.121395,-86.769998,Powered775,Powered,0.0,Scooter,0.15,Gotcha
2,2019-07-30 22:53:32.163,36.121441,-86.769995,Powered794,Powered,0.0,Scooter,0.15,Gotcha
3,2019-07-30 22:53:32.163,33.792609,-84.402744,Powered2503,Powered,27.0,Scooter,0.15,Gotcha
4,2019-07-30 22:53:32.163,36.121265,-86.770278,Powered1913,Powered,32.0,Scooter,0.15,Gotcha

In [18]:
jumpdf = pd.read_csv('../data/jumpdf.csv')

In [19]:
jumpdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:33:42,36.1195,-86.7534,Powered997dfabc-4fa3-557c-989c-33da0d096d6b,Powered,65.0,scooter,0.06,Jump
1,2019-07-30 17:33:42,36.1199,-86.7534,Poweredba213730-5704-5625-af7f-31c34d960b66,Powered,4.0,scooter,0.06,Jump
2,2019-07-30 17:33:42,36.1199,-86.7533,Poweredd6e29e2c-0f61-57ac-8237-5854332b595f,Powered,3.0,scooter,0.06,Jump
3,2019-07-30 17:33:42,36.1202,-86.7533,Powered7a0a9782-2e7b-5282-9d10-cbe0750c703e,Powered,0.0,scooter,0.06,Jump
4,2019-07-30 17:33:42,36.1199,-86.7534,Powered0d329ae3-b18b-5e2a-9f3f-c2d91679c324,Powered,3.0,scooter,0.06,Jump

In [20]:
limedf = pd.read_csv('../data/limedf.csv')

In [21]:
limedf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:18.710,36.182537,-86.793612,PoweredUD5AZXJ5UMT7B,Powered,75.0,scooter,0.15,Lime
1,2019-07-30 17:35:18.710,36.191159,-86.795243,PoweredEP7AKU3H6GPPG,Powered,38.0,scooter,0.15,Lime
2,2019-07-30 17:35:18.710,36.177788,-86.777875,PoweredSINZNV4OYDROU,Powered,47.0,scooter,0.15,Lime
3,2019-07-30 17:35:18.710,36.182087,-86.735612,Powered6PLOLGBTHDPWE,Powered,55.0,scooter,0.15,Lime
4,2019-07-30 17:35:18.710,36.177627,-86.777723,Powered5R3YEGGZITMVT,Powered,68.0,scooter,0.15,Lime

In [22]:
lyftdf = pd.read_csv('../data/lyftdf.csv')

In [23]:
lyftdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:34:49.530,36.135925,-86.767207,Powered788160,Powered,48.0,scooter,0.15,Lyft
1,2019-07-30 17:55:09.643,36.162249,-86.790378,Powered334889,Powered,86.0,scooter,0.15,Lyft
2,2019-07-30 17:34:49.677,36.143064,-86.802958,Powered266526,Powered,17.0,scooter,0.15,Lyft
3,2019-07-30 17:34:49.700,36.177629,-86.777725,Powered876748,Powered,66.0,scooter,0.15,Lyft
4,2019-07-30 17:55:09.663,36.145882,-86.816281,Powered037286,Powered,95.0,scooter,0.15,Lyft

In [24]:
spindf = pd.read_csv('../data/spindf.csv')

In [25]:
spindf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:06.990,36.14528,-86.80569,Powered7049691,Powered,92.0,Scooter,0.23,Spin
1,2019-07-30 17:35:06.990,36.16017,-86.77848,Powered8631385,Powered,91.0,Scooter,0.23,Spin
2,2019-07-30 17:35:06.990,36.15249,-86.79480,Powered1741740,Powered,91.0,Scooter,0.23,Spin
3,2019-07-30 17:35:06.990,36.15947,-86.78826,Powered3114843,Powered,78.0,Scooter,0.23,Spin
4,2019-07-30 17:35:06.990,36.16382,-86.77891,Powered8546104,Powered,85.0,Scooter,0.23,Spin

In [26]:
tripsdf = pd.read_csv('../data/tripsdf.csv')

In [27]:
tripsdf.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [28]:
scooters_list = [birddf, boltdf, gotchadf, jumpdf, limedf, lyftdf, spindf]

In [29]:
scootersdf = pd.concat(scooters_list)

In [30]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [31]:
scootersdf.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [32]:
tripsdf.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

# chargelevel column in scootersdf has some null values

In [33]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 5.5+ GB

In [34]:
tripsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  object
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: float64(6), object(10)
memory usage: 69.0+ MB

In [35]:
scootersdf['pubdatetime'] = pd.to_datetime(scootersdf['pubdatetime'], dayfirst = False, format = 'mixed')

In [36]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 5.5+ GB

In [37]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [38]:
tripsdf['pubtimestamp'] = pd.to_datetime(tripsdf['pubtimestamp'], dayfirst = False, format = 'mixed')

In [39]:
tripsdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  datetime64[ns]
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: datetime64[ns](1), float64(6), object(9)
memory usage: 69.0+ MB

In [40]:
tripsdf.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [41]:
scooters_date_range = str(scootersdf['pubdatetime'].dt.date.min()) + ' to ' +str(scootersdf['pubdatetime'].dt.date.max())

In [42]:
scooters_date_range

'2019-05-01 to 2019-07-31'

In [43]:
trips_date_range = str(tripsdf['pubtimestamp'].dt.date.min()) + ' to ' +str(tripsdf['pubtimestamp'].dt.date.max())

In [44]:
trips_date_range

'2019-05-01 to 2019-08-01'

# trips table goes into August

# times for both tables are in 24 hour values

In [45]:
scootersdf.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

# bicycle isn't necesssary for this project

In [46]:
print(scootersdf['latitude'].min())
print(scootersdf['latitude'].max())

0.0
3609874.116666

In [47]:
print(scootersdf['longitude'].min())
print(scootersdf['longitude'].max())

-97.443879
0.0

In [48]:
print(tripsdf['startlatitude'].min())
print(tripsdf['startlatitude'].max())

35.8532
36.300029

In [49]:
print(tripsdf['endlatitude'].min())
print(tripsdf['endlatitude'].max())

-36.850405
51.045409

In [50]:
print(tripsdf['startlongitude'].min())
print(tripsdf['startlongitude'].max())

-86.918008
-86.3662

In [51]:
print(tripsdf['endlongitude'].min())
print(tripsdf['endlongitude'].max())

-122.673729
174.764886

In [52]:
print(tripsdf['tripdistance'].min())
print(tripsdf['tripdistance'].max())

-20324803.8
31884482.6476

# the negative min value doesn't make sense and the max value seems extremely high

In [53]:
print(tripsdf['tripduration'].min())
print(tripsdf['tripduration'].max())

-19.3582666667
512619.0

# again the negative min value doesn't make sense and the max value is again too high

In [54]:
tripsdf['companyname'].value_counts()

companyname
Lime             225694
Bird             152745
Lyft             120991
SPIN              34450
Bolt Mobility     21890
JUMP               6437
Gotcha             3315
Name: count, dtype: int64

In [55]:
scootersdf['companyname'].value_counts()

companyname
Jump      21835098
Lime      16524261
Bird      12251590
Lyft       9087043
Spin       5559573
Gotcha     4679280
Bolt       3477198
Name: count, dtype: int64

In [56]:
tripsdf['companyname'] = tripsdf['companyname'].str.replace('Bolt Mobility','Bolt').str.replace('SPIN','Spin').str.replace('JUMP','Jump')

# 1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [57]:
company_scooters = scootersdf[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

In [58]:
company_scooters

  companyname  count
2      Gotcha    224
1        Bolt    360
6        Spin    805
3        Jump   1210
5        Lyft   1735
4        Lime   1824
0        Bird   3860

In [59]:
scootersdf['Month'] = scootersdf['pubdatetime'].dt.month

In [60]:
scootersdf['Month']

0          7
1          7
2          7
3          7
4          7
          ..
5559568    7
5559569    7
5559570    7
5559571    7
5559572    7
Name: Month, Length: 73414043, dtype: int32

In [61]:
scooters_may = scootersdf[scootersdf['Month'] == 5]

In [62]:
scooters_may

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month
145127,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.00,Bird,5
145128,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.00,Bird,5
145129,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.00,Bird,5
145130,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.00,Bird,5
145131,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.00,Bird,5
...,...,...,...,...,...,...,...,...,...,...
1361975,2019-05-31 23:58:00.927,36.168730,-86.772700,Powered3583001,Powered,51.0,Scooter,0.23,Spin,5
1361976,2019-05-31 23:58:00.927,36.151560,-86.802050,Powered3614808,Powered,67.0,Scooter,0.23,Spin,5
1361977,2019-05-31 23:58:00.927,36.157440,-86.774750,Powered1083720,Powered,88.0,Scooter,0.23,Spin,5
1361978,2019-05-31 23:58:00.927,36.162840,-86.780470,Powered4154805,Powered,72.0,Scooter,0.23,Spin,5
1361979,2019-05-31 23:58:00.927,36.168540,-86.772030,Powered6282137,Powered,82.0,Scooter,0.23,Spin,5

In [63]:
scooters_june = scootersdf[scootersdf['Month'] == 6]

In [64]:
scooters_june

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month
1091548,2019-06-01 00:00:21.130,36.176962,-86.750249,PoweredCBZVU,Powered,92.0,scooter,0.15,Bird,6
2691952,2019-06-01 00:00:21.130,36.155387,-86.797013,PoweredCTX96,Powered,46.0,scooter,0.15,Bird,6
2691953,2019-06-01 00:00:21.130,36.151526,-86.814355,PoweredXN7EH,Powered,52.0,scooter,0.15,Bird,6
3040402,2019-06-01 00:00:21.130,36.146051,-86.811888,PoweredA2MXN,Powered,100.0,scooter,0.15,Bird,6
3497742,2019-06-01 00:00:21.133,36.175343,-86.794275,Powered9NP8P,Powered,67.0,scooter,0.15,Bird,6
...,...,...,...,...,...,...,...,...,...,...
3869966,2019-06-30 23:59:23.483,36.156630,-86.796420,Powered8207114,Powered,2.0,Scooter,0.23,Spin,6
3869967,2019-06-30 23:59:23.483,36.164432,-86.795860,Powered5965864,Powered,61.0,Scooter,0.23,Spin,6
3869968,2019-06-30 23:59:23.483,36.168760,-86.772710,Powered1756874,Powered,95.0,Scooter,0.23,Spin,6
3869969,2019-06-30 23:59:23.483,36.172270,-86.788600,Powered4442615,Powered,0.0,Scooter,0.23,Spin,6
3869970,2019-06-30 23:59:23.483,36.146920,-86.799320,Powered7914843,Powered,75.0,Scooter,0.23,Spin,6

In [65]:
scooters_july = scootersdf[scootersdf['Month'] == 7]

In [66]:
scooters_july

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird,7
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird,7
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird,7
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird,7
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird,7
...,...,...,...,...,...,...,...,...,...,...
5559568,2019-07-30 17:30:06.803,36.153090,-86.783980,Powered8052471,Powered,92.0,Scooter,0.23,Spin,7
5559569,2019-07-30 17:30:06.803,36.158640,-86.767830,Powered4853276,Powered,99.0,Scooter,0.23,Spin,7
5559570,2019-07-30 17:30:06.803,36.152500,-86.783750,Powered1245835,Powered,96.0,Scooter,0.23,Spin,7
5559571,2019-07-30 17:30:06.803,36.158020,-86.783790,Powered7927186,Powered,100.0,Scooter,0.23,Spin,7
5559572,2019-07-30 17:30:06.803,36.164380,-86.769250,Powered4053444,Powered,99.0,Scooter,0.23,Spin,7

In [67]:
company_scooters_may = scooters_may[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

In [68]:
company_scooters_may

  companyname  count
2      Gotcha    223
1        Bolt    346
6        Spin    687
3        Jump    976
5        Lyft   1376
4        Lime   1632
0        Bird   3064

In [69]:
company_scooters_june = scooters_june[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

In [70]:
company_scooters_june

  companyname  count
2      Gotcha    223
1        Bolt    333
6        Spin    713
3        Jump   1036
5        Lyft   1152
4        Lime   1461
0        Bird   2910

In [71]:
company_scooters_july = scooters_july[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

In [72]:
company_scooters_july

  companyname  count
2      Gotcha    224
1        Bolt    276
6        Spin    570
4        Lime    903
5        Lyft   1026
3        Jump   1206
0        Bird   2583

In [73]:
may_june = company_scooters_may.merge(company_scooters_june, how = 'inner', on = 'companyname')

In [74]:
company_scooters_months = may_june.merge(company_scooters_july, how = 'inner', on = 'companyname')

In [75]:
company_scooters_months

  companyname  count_x  count_y  count
0      Gotcha      223      223    224
1        Bolt      346      333    276
2        Spin      687      713    570
3        Jump      976     1036   1206
4        Lyft     1376     1152   1026
5        Lime     1632     1461    903
6        Bird     3064     2910   2583

# The number of scooters did change over time. Most decreased except Jump

# 2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:
Removal of staff servicing and test trips
Removal of trips below one minute
Trip lengths are capped at 24 hours
Are the scooter companies in compliance with the second and third part of this rule?

In [76]:
short_trips = tripsdf.query('`tripduration` < 1')

In [77]:
short_trips[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

  companyname  count
1        Lime    383
0        Bird   1229
2        Lyft   1329

In [78]:
long_trips = tripsdf.query('`tripduration` > 1440')

In [79]:
long_trips[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'count')\
                                                        .sort_values(['count'])

  companyname  count
1        Lyft      2
2        Spin     28
0        Bolt    351

# Lime, Bird, Lyft, Spin and Bolt were not in compliance

# 3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [80]:
sumdid_per_day = tripsdf.groupby(['sumdid', 'startdate']).size().reset_index(name='times_used_per_day')

In [81]:
sumdid_per_day

,sumdid,startdate,times_used_per_day
0,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-24,1
1,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-25,2
2,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-26,7
3,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-27,4
4,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-29,1
...,...,...,...
202457,Poweredffcc1b11-af95-5e06-b002-82ffb342aae8,2019-07-05,1
202458,Poweredffcc1b11-af95-5e06-b002-82ffb342aae8,2019-07-14,1
202459,Poweredffcc1b11-af95-5e06-b002-82ffb342aae8,2019-07-15,1
202460,Poweredffcc1b11-af95-5e06-b002-82ffb342aae8,2019-07-27,1
202461,StandardLIRPOZ7X3ZVGO,2019-06-08,1

In [82]:
sumdid_per_day['times_used_per_day'].mean()

2.793225395382837

In [83]:
scooters_trips_per_day = sumdid_per_day.groupby('sumdid')['times_used_per_day'].sum().reset_index()

In [84]:
scooters_trips_per_day

                                            sumdid  times_used_per_day
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619                  92
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d                  57
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df                  81
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7                  71
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c                  96
...                                            ...                 ...
9000   Poweredff356f94-2252-5432-b484-ad9679bf4b8d                  11
9001   Poweredff4b01f3-1f3f-5d6b-b1c5-5d6628ffa629                   6
9002   Poweredff8a28ab-0ffb-59ce-9b1e-2d1299a25634                  23
9003   Poweredffcc1b11-af95-5e06-b002-82ffb342aae8                   6
9004                         StandardLIRPOZ7X3ZVGO                   1

[9005 rows x 2 columns]

In [85]:
scootersdf['Day'] = scootersdf['pubdatetime'].dt.day

In [86]:
scootersdf['Day']

0          30
1          30
2          30
3          30
4          30
           ..
5559568    30
5559569    30
5559570    30
5559571    30
5559572    30
Name: Day, Length: 73414043, dtype: int32

In [87]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month,Day
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird,7,30
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird,7,30
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird,7,30
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird,7,30
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird,7,30

In [88]:
scooters_sumid = scootersdf.groupby(['sumdid', 'companyname', 'Month', 'Day']).size()\
                                    .reset_index(name='number_of_rides')

In [89]:
scooters_sumid

,sumdid,companyname,Month,Day,number_of_rides
0,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,5,24,181
1,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,5,25,263
2,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,5,26,62
3,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,5,27,149
4,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,5,28,84
...,...,...,...,...,...
413558,StandardNW5HJFO4R32LY,Lime,7,28,288
413559,StandardNW5HJFO4R32LY,Lime,7,29,288
413560,StandardNW5HJFO4R32LY,Lime,7,30,287
413561,StandardNW5HJFO4R32LY,Lime,7,31,288
413562,StandardZPUQESHVPP74J,Lime,6,13,6

In [90]:
scooters_rides_per_day = scooters_sumid.groupby(['sumdid', 'companyname'])['number_of_rides'].count().reset_index()

In [91]:
scooters_rides_per_day

,sumdid,companyname,number_of_rides
0,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,Bolt,68
1,Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d,Bolt,47
2,Powered-03be23ca-d43b-222f-be54-e44b5b4690df,Bolt,62
3,Powered-046201fb-6532-1f37-6334-3612fb1e61f7,Bolt,59
4,Powered-0479bb84-afbd-0426-f1c4-df628542a88c,Bolt,66
...,...,...,...
10013,Standard5JXOV277MCWID,Lime,1
10014,StandardNPOOZNUSGAXZN,Lime,1
10015,StandardNUTLLXP4G37OI,Lime,1
10016,StandardNW5HJFO4R32LY,Lime,92
10017,StandardZPUQESHVPP74J,Lime,1

# 4. Metro would like to know how many scooters are needed, and something that could help with this is knowing peak demand. Estimate the highest count of scooters being used at the same time. When were the highest volume times? Does this vary by zip code or other geographic region?

In [92]:
tripsdf['startdatetime'] = pd.to_datetime(tripsdf['startdate'].astype('str')+' '+tripsdf['starttime'].astype('str'), format ='mixed')

In [93]:
(tripsdf
 .assign(hour = tripsdf['startdatetime'].dt.hour)
 .groupby(['hour'])
 ['startdatetime']
 .count()
 .reset_index()
)

    hour  startdatetime
0      0          43462
1      1          32690
2      2          24463
3      3          21827
4      4          16280
5      5           9471
6      6           6601
7      7           4334
8      8           2194
9      9           1132
10    10           1524
11    11           3630
12    12           7413
13    13          11705
14    14          17846
15    15          25907
16    16          36433
17    17          43339
18    18          44717
19    19          44698
20    20          41973
21    21          40902
22    22          38149
23    23          44832

In [98]:
import geopandas as gpd

In [99]:
zipcodes = gpd.read_file('../data/zipcodes.geojson')
print(zipcodes.crs)
zipcodes.head( )

EPSG:4326

,zip,objectid,po_name,shape_stlength,shape_starea,geometry
0,37115,1,MADISON,178783.02488886821,596553400.57885742,"MULTIPOLYGON (((-86.68725 36.31821, -86.68722 ..."
1,37216,3,NASHVILLE,75820.997821400058,188884682.28344727,"MULTIPOLYGON (((-86.73451 36.23774, -86.73425 ..."
2,37204,9,NASHVILLE,93180.292250425613,200664795.51708984,"MULTIPOLYGON (((-86.77914 36.13424, -86.77923 ..."
3,37027,11,BRENTWOOD,159760.6942933173,174978422.04101562,"MULTIPOLYGON (((-86.81258 36.06319, -86.81263 ..."
4,37064,18,FRANKLIN,28995.828320601937,46969608.005737305,"MULTIPOLYGON (((-87.02197 36.01200, -87.02140 ..."

In [100]:
trips_start_geo = gpd.GeoDataFrame(tripsdf,
                           crs = zipcodes.crs,
                           geometry = gpd.points_from_xy(tripsdf.startlongitude, tripsdf.startlatitude))

In [101]:
trips_end_geo = gpd.GeoDataFrame(tripsdf,
                           crs = zipcodes.crs,
                           geometry = gpd.points_from_xy(tripsdf.endlongitude, tripsdf.endlatitude))

In [102]:
zipcodes = zipcodes[['zip', 'po_name', 'geometry']]

In [103]:
start_points_by_zip = gpd.sjoin(trips_start_geo, zipcodes, predicate = 'within')

In [104]:
end_points_by_zip = gpd.sjoin(trips_end_geo, zipcodes, predicate = 'within')

In [105]:
start_points_by_zip['zip'].value_counts()

zip
37203    258255
37201    102877
37219     46556
37212     35628
37204     28374
37208     23216
37213     21552
37206     20864
37210     13428
37240      5226
37232      2786
37207      2674
37209      2045
37228       509
37215       464
37216       409
37205       354
37211       113
37217        51
37214        44
37013        39
37218        24
37115        16
37221        10
37220         3
37138         2
37072         1
Name: count, dtype: int64

In [106]:
end_points_by_zip['zip'].value_counts()

zip
37203    256341
37201    104238
37219     44201
37212     36606
37208     24269
37204     24264
37206     21765
37213     21040
37210     13900
37240      5511
37207      3797
37209      3028
37232      2673
37215       937
37216       863
37228       782
37205       646
37211       248
37217        89
37214        83
37218        70
37013        44
37115        36
37221        21
37220         4
37138         2
37027         2
37076         2
37072         2
37189         1
Name: count, dtype: int64

# 5. Stretch Goal: SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/WeGo-Transit-Bus-Stops/vfe9-k7vc/about_data.